FutureDesigns/uEZ/uEZ/Source/Platform/FDI/uEZGUI_RX62N_35QT/uEZGUI_RX62N_35QT.c
    // Ensure the RTC exists in the HAL level
    RX62N_RTC_Require();
    RTC_Generic_Create("RTC", "RTC");    
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZPlatform_ADC0_Require
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the ADC0 device driver.
 *---------------------------------------------------------------------------*/
void UEZPlatform_S12AD_Require(void)
{
    TUInt8 allChannels = 0xFF;
    DEVICE_CREATE_ONCE();
    RX62N_S12AD_Require(allChannels);
    ADCBank_Generic_Create("ADC_S12AD", "ADC_S12AD");
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZPlatform_Touchscreen_Require
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the touchscreen and touch sensitivity for four wire resistive
 *---------------------------------------------------------------------------*/
void UEZPlatform_Touchscreen_Require(void)
{
   const TS_DirectDrive_Configuration tsConfig = {
        // XDrive is P93
		{GPIO_P93},
        // YDrive is P73
		{GPIO_P73},
		// iInputXL is AN6
		{ "ADC_S12AD",   6},
		// iInputXR is AN4
		{ "ADC_S12AD",   4},
		// iInputYU is AN5
		{ "ADC_S12AD",   5},
		// iInputYD is AN7
		{ "ADC_S12AD",   7},
    };
	T_uezDevice ts;

	DEVICE_CREATE_ONCE();
	UEZPlatform_S12AD_Require();
	
	Touchscreen_DirectDrive_Create("Touchscreen", &tsConfig);
    UEZDeviceTableFind("Touchscreen", &ts);
    UEZTSSetTouchDetectSensitivity(ts, 0x2000, 0x6000);
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZPlatform_WiredNetwork0_Require
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the networking for Wired connections.
 *---------------------------------------------------------------------------*/
void UEZPlatform_WiredNetwork0_Require(void)
{
    DEVICE_CREATE_ONCE();

    // Wired network needs an EMAC
    RX62N_176_EMAC_RMII_Require();

    // Create the network driver for talking to lwIP on a wired
    // network.
    Network_lwIP_Create("WiredNetwork0");
}

/*---------------------------------------------------------------------------*
 * Routine:  uEZPlatformInit
 *---------------------------------------------------------------------------*
 * Description:
 *      Initialize the board with all the proper settings.
 *      Registers all peripherals specific to this board.
 *---------------------------------------------------------------------------*/
void uEZPlatformInit(void)
{
    // Do any initialiation necessary before the RTOS is started
}

void UEZPlatform_Standard_Require(void)
{
// Setup console immediately
#if UEZ_ENABLE_CONSOLE_ALT_PWR_COM
    UEZPlatform_Console_ALT_PWR_COM_Require(
        UEZ_CONSOLE_WRITE_BUFFER_SIZE,
        UEZ_CONSOLE_READ_BUFFER_SIZE);
#else
    UEZPlatform_Console_Expansion_Require(
        UEZ_CONSOLE_WRITE_BUFFER_SIZE,
        UEZ_CONSOLE_READ_BUFFER_SIZE);
#endif

	UEZPlatform_LCD_Require();
    
	UEZPlatform_Touchscreen_Require();
	UEZPlatform_DataFlash_Require();
	UEZPlatform_AudioAmp_Require();
	UEZPlatform_SDCard_Drive_Require(1);
	UEZPlatform_WiredNetwork0_Require();
	UEZPlatform_IRTC_Require();
	UEZPlatform_AudioMixer_Require();
	UEZAudioMixerMute(UEZ_AUDIO_MIXER_OUTPUT_MASTER);
    UEZPlatform_Speaker_Require();
    //UEZAudioMixerUnmute(UEZ_AUDIO_MIXER_OUTPUT_MASTER);
} 

// Modify pins for expansion before use, modify get, set, clear routine for RX
void UEZPlatform_WiFiProgramMode(TBool runMode)
{    
#define GPIO_WIFI_FAC_RST       GPIO_NONE
#define GPIO_WIFI_SRSTn         GPIO_NONE
#define GPIO_WIFI_IRQ           GPIO_NONE
#define GPIO_WIFI_MODE          GPIO_NONE

    if(runMode == ETrue) {
        printf("GainSpan Run Mode ...\n");        
    } else {
        printf("GainSpan Programming Mode ...\n");
    }
    RTOS_ENTER_CRITICAL();
    
    UEZGPIOSet(GPIO_WIFI_FAC_RST);        // WIFI_FAC_RST
    UEZGPIOSetMux(GPIO_WIFI_FAC_RST, 0);
    UEZGPIOOutput(GPIO_WIFI_FAC_RST);
    
    UEZGPIOClear(GPIO_WIFI_SRSTn);        // WIFI_SRSTn
    UEZGPIOSetMux(GPIO_WIFI_SRSTn, 0);
    UEZGPIOOutput(GPIO_WIFI_SRSTn);       // WIFI_SRSTn
    
    UEZGPIOInput(GPIO_WIFI_IRQ);       // WIFI IRQ

    if(runMode == ETrue) {
        UEZGPIOClear(GPIO_WIFI_MODE);  // WIFI RUN MODE
    } else {
        UEZGPIOSet(GPIO_WIFI_MODE);    // WIFI PROGRAM ON
    }
    UEZGPIOOutput(GPIO_WIFI_MODE);       
                
    UEZGPIOUnlock(GPIO_P00);       // RX6XN TX
    UEZGPIOSetMux(GPIO_P00, 0);
    UEZGPIOOutput(GPIO_P00);

    UEZGPIOUnlock(GPIO_P01);       // RX6XN RX
    UEZGPIOSetMux(GPIO_P01, 0);
    UEZGPIOInput(GPIO_P01);

    UEZGPIOUnlock(GPIO_NONE);      // WIFI TX
    UEZGPIOSetMux(GPIO_NONE, 0);
    UEZGPIOOutput(GPIO_NONE);

    UEZGPIOUnlock(GPIO_NONE);      // WIFI RX
    UEZGPIOSetMux(GPIO_NONE, 0);
    UEZGPIOInput(GPIO_NONE);

    //UEZTaskDelay(1000); // for debug
    UEZGPIOSet(GPIO_WIFI_SRSTn);          // WIFI_SRSTn

    //CPUDisableInterrupts(); // need to change to RX version
    while (1) {
        /*if (LPC_GPIO0->PIN & (1 << 3))  // RX6XN RX = GPIO_P01
            LPC_GPIO0->SET = (1 << 15); // WIFI TX = ?
        else
            LPC_GPIO0->CLR = (1 << 15);

        if (LPC_GPIO0->PIN & (1 << 16)) // WIFI RX = ?
            LPC_GPIO0->SET = (1 << 2);  // RX6XN TX = GPIO_P00
        else
            LPC_GPIO0->CLR = (1 << 2);  // RX6XN TX = GPIO_P00
            */
    }
}

TUInt16 UEZPlatform_LCDGetHeight(void)
{
    return UEZ_LCD_DISPLAY_HEIGHT;
}
TUInt16 UEZPlatform_LCDGetWidth(void)
{
    return UEZ_LCD_DISPLAY_WIDTH;
}
#include <Source/Library/GUI/FDI/SimpleUI/SimpleUI_Types.h>
TUInt32 UEZPlatform_LCDGetFrame(TUInt16 aFrameNum)
{
    return (TUInt32)FRAME(aFrameNum);
}
TUInt32 UEZPlatform_LCDGetFrameBuffer(void)
{
    return (TUInt32)LCD_FRAME_BUFFER;
}
TUInt32 UEZPlatform_LCDGetFrameSize(void)
{
    return FRAME_SIZE;
}
TUInt32 UEZPlatform_SerialGetDefaultBaud(void)
{
    return SERIAL_PORTS_DEFAULT_BAUD;
}
TUInt32 UEZPlatform_ProcessorGetFrequency(void)
{
    return PROCESSOR_OSCILLATOR_FREQUENCY;
}
TUInt32 UEZPlatform_GetEMACPHYAddress(void)
{
    return 1; // National DP83640
}
TUInt32 UEZPlatform_GetBaseAddress(void)
{
    return LCD_DISPLAY_BASE_ADDRESS;
}

#if INCLUDE_EMWIN
#include <Source/Library/GUI/SEGGER/emWin/LCD.h>
#include <Source/Library/GUI/SEGGER/emWin/GUIDRV_Lin.h>
const void* UEZPlatform_GUIColorConversion(void)
{
    return GUICC_M565;
}

